app/Http/Helpers.php

select * from `messages` where `read_at` is null order by `created_at` desc
---
    public static function messageList()
    {
        return Message::whereNull('read_at')->orderBy('created_at', 'desc')->get();

select sum(`quantity`) as aggregate from `carts` where `user_id` = 1 and `order_id` is null
---
    public static function cartCount($user_id = '')
    {

        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Cart::where('user_id', $user_id)->where('order_id', null)->sum('quantity');

select * from `carts` where `user_id` = 1 and `order_id` is null
select * from `products` where `products`.`id` in (21, 22)
---
    public static function getAllProductFromCart($user_id = '')
    {
        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Cart::with('product')->where('user_id', $user_id)->where('order_id', null)->get();

select sum(`amount`) as aggregate from `carts` where `user_id` = 1 and `order_id` is null
---
    public static function totalCartPrice($user_id = '')
    {
        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Cart::where('user_id', $user_id)->where('order_id', null)->sum('amount');

select sum(`quantity`) as aggregate from `wishlists` where `user_id` = 1 and `cart_id` is null
---
    public static function wishlistCount($user_id = '')
    {

        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('quantity');

select * from `products` where `products`.`id` in (21)
select * from `wishlists` where `user_id` = 1 and `cart_id` is null
---
    public static function getAllProductFromWishlist($user_id = '')
    {
        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Wishlist::with('product')->where('user_id', $user_id)->where('cart_id', null)->get();

select sum(`amount`) as aggregate from `wishlists` where `user_id` = 1 and `cart_id` is null
---
    public static function totalWishlistPrice($user_id = '')
    {
        if (Auth::check()) {
            if ($user_id == "") $user_id = auth()->user()->id;
            return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('amount');