app/Http/Controllers/BannerController.php

select * from `banners` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `banners`
---
    public function index()
    {
        $banner = Banner::orderBy('id', 'DESC')->paginate(10);

select count(*) as aggregate from `banners` where `slug` = 'anh-hoat-dong-nhom'
insert into `banners` (`title`, `description`, `photo`, `status`, `slug`, `updated_at`, `created_at`) values ('Ảnh hoạt đông nhóm', '<p>hoat dong nhom</p>', '/storage/photos/1/Banner/banner 3.png', 'active', 'anh-hoat-dong-nhom', '2022-09-04 06:24:14', '2022-09-04 06:24:14')
---
    public function store(Request $request)
    {
        // return $request->all();
        $this->validate($request, [
            'title' => 'string|required|max:50',
            'description' => 'string|nullable',
            'photo' => 'string|required',
            'status' => 'required|in:active,inactive',
        ]);
        $data = $request->all();
        $slug = Str::slug($request->title);
        $count = Banner::where('slug', $slug)->count();
        if ($count > 0) {
            $slug = $slug . '-' . date('ymdis') . '-' . rand(0, 999);
        }
        $data['slug'] = $slug;
        // return $slug;
        $status = Banner::create($data);