app/Http/Controllers/BrandController.php

    public function index()
    {
        if(Gate::denies('list_brand'))
        {
            abort('403');
        }
        $brand = Brand::orderBy('id', 'DESC')->paginate();
---
select * from `brands` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `brands`

    public function edit($id)
    {
        if(Gate::denies('update_brand'))
        {
            abort('403');
        }
        $brand = Brand::find($id);
---
select * from `brands` where `brands`.`id` = '10' limit 1