app/Http/Controllers/CartController.php

    public function cartDelete(Request $request)
    {
        $cart = Cart::find($request->id);
        if ($cart) {
            $cart->delete();
---
select * from `carts` where `carts`.`id` = '23' limit 1
delete from `carts` where `id` = 23

    public function cartUpdate(Request $request)
    {
        // dd($request->all());
        if ($request->quant) {
            $error = array();
            $success = '';
            // return $request->quant;
            foreach ($request->quant as $k => $quant) {
                // return $k;
                $id = $request->qty_id[$k];
                // return $id;
                $cart = Cart::find($id);
---
select * from `carts` where `carts`.`id` = '23' limit 1