app/Http/Controllers/CategoryController.php

    public function create()
    {
        if(Gate::denies('add_categories'))
        {
            abort('403');
        }
        $parent_cats = Category::where('is_parent', 1)->orderBy('title', 'ASC')->get();
---
select * from `categories` where `is_parent` = 1 order by `title` asc