app/Http/Controllers/CouponController.php

select * from `coupons` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `coupons`
---
    public function index()
    {
        $coupon = Coupon::orderBy('id', 'DESC')->paginate('10');