app/Http/Controllers/OrderController.php

    public function index()
    {
        $orders = Order::orderBy('id', 'DESC')->paginate(10);
---
select * from `orders` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `orders`

    public function incomeChart(Request $request)
    {
        $year = \Carbon\Carbon::now()->year;
        // dd($year);
        $items = Order::with(['cart_info'])->whereYear('created_at', $year)->where('status', 'delivered')->get()
            ->groupBy(function ($d) {
                return \Carbon\Carbon::parse($d->created_at)->format('m');
            });
        // dd($items);
        $result = [];
        foreach ($items as $month => $item_collections) {
            foreach ($item_collections as $item) {
                $amount = $item->cart_info->sum('amount');
---
select * from `orders` where year(`created_at`) = 2022 and `status` = 'delivered'
select * from `carts` where `carts`.`order_id` in (6, 7)