app/Http/Controllers/ProductController.php

    public function create()
    {
        if(Gate::denies('add_products'))
        {
            abort('403');
        }
        $brand = Brand::get();
        $category = Category::where('is_parent', 1)->get();
---
select * from `brands`
select * from `categories` where `is_parent` = 1