app/Http/Controllers/ShippingController.php

select * from `shippings` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `shippings`
---
    public function index()
    {
        if(Gate::denies('list_transfer'))
        {
            abort('403');
        }
        $shipping = Shipping::orderBy('id', 'DESC')->paginate(10);