app/Models/Order.php

select count(*) as aggregate from `orders`
---
    public static function countActiveOrder()
    {
        $data = Order::count();