app/Models/ProductReview.php

select count(*) as aggregate from `product_reviews`
---
    public static function getAllReview()
    {
        return ProductReview::with('user_info')->orderBy('created_at','desc')->paginate(10);

select * from `users` where `users`.`id` in (1, 30)
---
    public static function getAllUserReview()
    {
        return ProductReview::where('user_id', auth()->user()->id)->with('user_info')->paginate(10);