app/Models/Product.php

    public static function getAllProduct()
    {
        return Product::with(['cat_info', 'sub_cat_info'])->orderBy('id', 'desc')->paginate(10);
---
select * from `products` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `products`

    public function rel_prods()
    {
        return $this->hasMany('App\Models\Product', 'cat_id', 'cat_id')->where('status', 'active')->orderBy('id', 'DESC')->limit(8);
---
select * from `products` where `status` = 'active' and `products`.`cat_id` in (3) order by `id` desc limit 8

    public static function getProductBySlug($slug)
    {
        return Product::with(['cat_info', 'rel_prods', 'getReview'])->where('slug', $slug)->first();
---
select * from `products` where `slug` = 'quan-au-nam-aristino-atr02008' limit 1

    public static function countActiveProduct()
    {
        $data = Product::where('status', 'active')->count();
---
select count(*) as aggregate from `products` where `status` = 'active'